from aiogram import Router, F
from aiogram.types import Message

router = Router()

@router.message(F.text.in_({"راهنما", "/help", "❓ راهنما"}))
async def show_help_menu(message: Message):
    help_text = (
        "「 🐱 **میوبت | MEOWBET** 🎰 」\n\n"
        
        "🎲 **بازی تاس (تاس تعاملی ۳ تایی):**\n"
        "• دستورات: `زوج [مبلغ]` یا `فرد [مبلغ]` (مثلاً: `زوج 50000` یا `فرد 2000`)\n"
        "• پس از ثبت شرط، ربات شما را صدا می‌زند و باید **۳ عدد تاس** 🎲 پشت سر هم داخل گروه ارسال کنید (تاس نباید فوروارد شود).\n"
        "• 💰 ضریب برد: `1.5x` روی جمع کل تاس‌ها.\n\n"
        
        "💩 **بازی پوپ (Pop):**\n"
        "• دستور: `پوپ [مبلغ]` یا `#پوپ 10000` → شروع بازی شانسی ۵ مرحله‌ای.\n"
        "• 💰 ضرایب مراحل: `1.2x` ← `1.4x` ← `1.6x` ← `2.0x` ← `2.5x`\n\n"
        
        "💣 **بازی مین (Mine):**\n"
        "• دستور: `مین [مبلغ]` → شروع بازی مینی‌گیم مین در جدول ۳ در ۳ برای پیدا کردن خانه‌های امن و دور شدن از بمب 💎.\n\n"
        
        "🎯 **راهنمای عمومی کاربر:**\n"
        "• 💰 **موجودی** → نمایش موجودی حساب کاربری و مقدار میو.\n"
        "• 💳 **شارژ** → افزایش موجودی حساب.\n"
        "• 💸 **برداشت** → ثبت درخواست برداشت وجه.\n"
        "• ❓ **راهنما** → نمایش همین راهنما"
    )
    
    await message.reply(help_text, parse_mode="Markdown")
